IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
      * THIS IS A COMMENT
       PROCEDURE DIVISION.
           DISPLAY 'HELLO, HERCULES!'.
           STOP RUN.