//HELLOJOB JOB (COBOL),'TEST',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//STEP1    EXEC IKFCB
//COB.SYSIN DD *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO, HERCULES!'.
           STOP RUN.
/*
//