//INSTPS1X   JOB  30000000,'MVS1 JOB CAR  ',MSGLEVEL=(1,1),
//           CLASS=A,
//           MSGCLASS=Q,
//           NOTIFY=&SYSUID,
//           TIME=1440,
//           REGION=0M
//COMPILE  EXEC  IGYWCL,
//         PARM=(OFFSET,NOLIST,ADV),
//         PGMLIB='INSTPS1.COBOL.LOADLIB',GOPGM=HELLO
//COBOL.SYSIN   DD DSN=INSTPS1.COBOL(HELLO),DISP=SHR
//COBOL.SYSLIB  DD DSN=INSTPS1.COBOL.LOADLIB,DISP=SHR